---
title: DirectContext3DDocumentUtils
classe: Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# DirectContext3DDocumentUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ISet<ElementId> GetDirectContext3DHandleInstances(Document, ElementId)` | `DirectContext3DDocumentUtils.GetDirectContext3DHandleInstances(aDocument, handleCategory)` | ISet<ElementId> |
| `ISet<ElementId> GetDirectContext3DHandleTypes(Document, ElementId)` | `DirectContext3DDocumentUtils.GetDirectContext3DHandleTypes(aDocument, handleCategory)` | ISet<ElementId> |
| `Boolean IsADirectContext3DHandleCategory(ElementId)` | `DirectContext3DDocumentUtils.IsADirectContext3DHandleCategory(categoryId)` | Boolean |
| `Boolean IsADirectContext3DHandleInstance(Document, ElementId)` | `DirectContext3DDocumentUtils.IsADirectContext3DHandleInstance(aDocument, elementId)` | Boolean |
| `Boolean IsADirectContext3DHandleType(Document, ElementId)` | `DirectContext3DDocumentUtils.IsADirectContext3DHandleType(aDocument, elementId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```